hsSphere_rcf_qtr/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3e-3;

deltaT          1e-7;

writeControl    adjustable;

writeInterval   5e-5;

purgeWrite      0;

writeFormat     binary;

writePrecision  15;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       2e-8;

functions
{
    gradP
    {
        type                grad;
        libs                (fieldFunctionObjects);
        field               p;
        executeControl      timeStep;
        executeInterval     20;
        writeControl        writeTime;
    }
    gradP_mag
    {
        type                mag;
        libs                (fieldFunctionObjects);
        field               grad(p);
        executeControl      timeStep;
        executeInterval     20;
        writeControl        writeTime;
    }
}


// ************************************************************************* //
