hsSphere_rcf_qtr/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          217;//1;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }
    outlet1
    {
        type            zeroGradient;
 /*        type            inletOutlet;
        inletValue      uniform $Tinlet;
        value           uniform $Tinlet; */
    }
    farfield
    {
        type            zeroGradient;
    }
    sphere
    {
        type            zeroGradient;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
